{
	"geode": "4.0.1",
	"gd": {
		"mac": "2.2074",
		"android": "2.2074"
	},
	"version": "v1.1.8",
	"early-load": false,
	"tags": [
		"gameplay", "performance", "enhancement"
	],
		"settings": {
	  "functionality": {
			"name": "Functionality",
			"type": "title"
		},
			"late-input-cutoff": {
			"name": "Handle Late Inputs",
			"type": "bool",
			"default": false,
			"description": "Cuando esta opcion esta deshabilitada, los inputs que se determina que ocurrieron <cl>despues del fotograma actual</c> se ponen en cola para ejecutarse en <cy>el inicio del siguiente fotograma</c>, independientemente de cuando se realizo el click. Habilitar esto puede <cg>mejorar la precision</c> en situaciones donde los ticks por frame son inconsistentes (como retraso o 144 fps), pero a <cr>a costa de la consistencia</c> (entradas atascadas)."
    },
		"thread-priority": {
			"name": "Thread Priority",
			"description": "Establece automaticamente la prioridad del Cbf al mas alto disponible.",
			"type": "bool",
			"default": true,
			"requires-restart": true
		},
		"mouse-fix": {
			"name": "Reduce Mouse Lag",
			"description": "Reduzce el retraso cuando utilice ratones con alta tasa de poiling rate.\nRequiere que CBF esté habilitado.",
			"type": "bool",
			"default": false
		},
		"physics-bypass": {
			"name": "Physics Bypass",
			"type": "title"
		},
		"input-offset-rand": {
			"name": "Input Offset +/-",
			"description": "Es lo mismo que la opcion <cl>input Offset</c>, pero con un <co>offset aleatorio</c>.¡Disfrutalo!.",
			"type": "int",
			"default": 0,
			"min": 0,
			"max": 1000
		},
		"input-offset": {
			"name": "Input Offset (ms)",
			"description": "Compensa todos los inputs en el tiempo seleccionado en milisegundos. Esta opcion no hara clic antes de los fotogramas. La opción <cl>handle late inputs</c> puede ser util para compensaciones positivas.",
			"type": "int",
			"default": 0,
			"min": -1000,
			"max": 1000
		},
		"single-threaded": {
			"name": "Run Single Threaded",
			"description": "Ejecuta el juego en un solo thread, entrelazando input y renderizado. Esto reduce significativamente el rendimiento, pero puede ser mas estable en algunos casos. Tambien forzara el ciclo de votacion en todo momento. El input polling rate se limitara a la frecuencia de actualizacion de la pantalla si esta opcion y VSync estan habilitados. Es más similar al draw divide tradicional.",
			"type": "bool",
			"default": false,
			"platforms": ["android"]
		},
		"bypass-mode": {
			"name": "Physics Bypass Mode",
			"description": "El modo 2.2 significa la menor cantidad posible de comprobaciones de colision por cuadro (con un minimo de 240 checks por segundo).\n\nEl modo 2.1 significa 4 checks de colision por cuadro a 60 fps o mas",
			"type": "string",
			"one-of": ["2.2", "2.1"],
			"default": "2.2"
		},
		"actual-delta": {
			"name": "Enable Physics Bypass",
			"description": "Reduce la tartamudez en algunos valores de FPS.incluso si está marcado \"Desactivar CBF\".\n\n¡ESTO ALTERARA LA FISICA Y PUEDE ROMPER ALGUNOS NIVELES! NO USE ESTO SI SU LISTA/TABLA DE Clasificaciones no permite este physic bypass puede ser baneado!",
			"type": "bool",
			"default": false
		},
				"loop-style": {
			"name": "Input Loop Type",
			"description": "Determina el estilo del <cf>input loop</c> en uso. Esta es una <cy>opción avanzada</c>, ¡evita cambiarla a menos que sepas lo que estas haciendo!\n<cc>Auto</c> selecciona la <cg>mejor opcion</c> de bucle de tu configuracion. <co>Wait</c> se mantendra hasta que se reciba una nueva entrada, lo que ha aumentado la precision y el rendimiento con respecto a <cf>Poll</c>. El uso de la opción de espera también <cr>deshabilitara globalmente</c> la compatibilidad con el controlador.",
			"type": "string",
			"one-of": ["auto", "poll", "wait"],
			"default": "auto",
			"platforms": ["android"]
		},
				"input-rate": {
			"name": "Alternative Polling Rate",
			"description": "Determina la <cc>cantidad de veces por segundo</c> que se leen los inputs, lo que aumenta la <cg>precision</c> a costa de cierto <co>rendimiento</c>. Los valores extremadamente altos <cr>tienen poca utilidad</c> a menos que estes utilizando el physics bypass. No tiene ningún efecto a menos que el juego esté en el <cf>Polling loop</c>.",
			"type": "int",
			"default": 720,
			"min": 3,
			"max": 2500,
			"control": {
				"slider": false
			},
			"platforms": ["android"]
		}
	},
	"id": "nightmoonGD.Click_between_frames",
	"name": "Click between frames",
	"developer": "nightmoonGD",
	"description": "Click Between Frames para Android hace que tus clics se registren entre fotogramas y ayuda a que jugar sea un poco mas facil y comodo."
	"repository": "https://github.com/nightmoonv/Click-Between-Frames-Android"
   }
